Revit 2024 API
GroupTypeId.RailingSystemFamilyTopRail Property
 Top Rail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId RailingSystemFamilyTopRail { get; }
Visual Basic
Public Shared ReadOnly Property RailingSystemFamilyTopRail As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RailingSystemFamilyTopRail {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace